class Parameter():
    def __init__(self):
        self.root = '/home/topnet/图片'
        self.folders = ['head2', 'tail', 'other']
        self.img_size = 320
        self.output_shape = 3
        self.tensorflow_backend = True
        self.svm_backend = False
        self.faltten = True
        self.use_img = False
        self.use_text = True
        self.show_res = False
        self.keywords = [
                [['all'], '销售合同', '供货合同', '购销合同', '承揽合同', '销购合同', '采购协议', '供应合同', '定做合同',
                 '加工合同','项目合同书', '采购合同', '销售合同', '买卖合同', '工程合同', '施工合同', '合同条款', '分包合同',
                 '安装合同', '服务合同', '维护合同', '承包合同'],
                [['all'], '甲方', '乙方', '买方', '卖方'],
                [['all'], '发包', '承包', '全称', '承租', '出租', '分包', '建设单位', '施工单位', '转让方', '受让方', '转让人',
                 '受让人', '出卖', '买受', '供方', '需方', '委托人', '代建人', '委托方', '代建方'],
                [['all'], '编号', '地点', '时间', '签订'],
                [['all'], '(以下简称', '（以下简称'],
                [['all'], '第一部分', '第一条', '第一节', '第一章'],
                [['all'], '一、', '一。', '一．', '一.'],
                [['all'], '协议'],
                [['all'], '概况', '概述'],
                [['all'], '(盖章', '(签字', '(公章', '(盖单位章', '（盖章', '（签字', '（公章', '（盖单位章', '盖章)', '签字)', '公章)',
                 '盖单位章)', '盖章）', '签字）', '公章）''盖单位章）', '(签名', '（签名', '签名）', '签名)', '(印章', '（印章', '印章）',
                 '印章)', ],
                [['all'], '附件', '附录', '目录', '说明'],
                [['all'], '中华人民共和'],
                [['all'], '有限公司'],
                [['all'], '代理', '委托'],
                [['all'], '法定代表'],
                [['all'], '补充'],
                [['all'], '自愿', '公平'],
            ]
